'''HomeWork
請設計一個程式，讓使用者輸入數值，只有加總偶數值，不加總正奇數值，如果輸入負數，結束程式。

顯示:========================================
請輸入第1個數值:456
請輸入第2個數值:455
請輸入第3個數值:123
請輸入第4個數值:-1
所有輸入的正偶數的加總是:xxxxxxx
============================================='''

sum = 0
num = 0
print("顯示:========================================")
while(True):
    num += 1
    input_value = int(input(f"請輸入第{num}個數值: "))
    if(input_value % 2 == 0):
        sum += input_value
    elif(input_value < 0):
        break
    else:
        continue
print(f"所有輸入的偶數的加總是:{sum}\n=============================================")